assessments-750/course-syllabus/Course-Syllabus.org
#+TITLE: CS 1XA3: Course Syllabus
#+AUTHOR: Curtis D'Alves
#+DATE: March 18th, 2021

#+OPTIONS: toc:nil
#+LaTeX_CLASS: customarticle
    
* Course Description
  
Computer Science 1XA3 is an experiential learning based course designed to teach
first year students common tools/skills utilized in the practice of software
engineering while learning about underlying theoretical computer science
concepts. Students are expected to already have a beginners knowledge of the
python programming language (previous or concurrent enrollment in CS 1MD3 is
recommended)

** Instructor (Contact Info)
   - Curtis D'Alves, Ph.D Candidate @ McMaster University
   - Office Hours: in ITB 229 (no specific hours, but please email before
     dropping by)
   - Email: curtis.dalves@gmail.com

** Lecture/Lab Sessions

 | *Lectures*        | Fr 9:30AM    | 10:20AM in BSB B135 |
 | *Lab Section L01* | TuFr 2:30PM  | 4:30PM in BSB 249   |
 | *Lab Section L02* | TuTh 9:30AM  | 11:30AM in BSB 244  |
 | *Lab Section L03* | MoWe 9:30AM  | 11:20AM in KTH B123 |
 | *Lab Section L04* | MoTh 12:30PM | 2:30PM in KTH B123  |

** Lecture Sessions
   There will be a single Lecture session each week presenting concepts in
   computer science interleaved with discussion sessions on these topics.
   Students will be broken up into groups for guided discussion sessions and
   brainstorm answers that will be presented in class by a volunteer
** Lab Sessions
   There will be two Lab sessions each week. The first session each week will be a Lab
   Activity session that students will complete with TA assistance as needed and
   the second session will present practical programming content with
   live coding demonstrations (that students will be encouraged to follow along
   with).
   
* Course Schedule with topics
| Week           | Lecture                                   | Activity             | Lab                   |
|----------------+-------------------------------------------+----------------------+-----------------------|
| Jan 6 - 12     | McMaster ECCS / Intro Un*x Systems        | Installation Session | Course Overview       |
| Jan 13 - 19    | Shells, FileSystems and Trees             | Terminus Game        | SSH Activity          |
| Jan 20 - 26    | Version Control, Git and Graphs           | FileSystems          | Git Repo Creation     |
| Jan 27 - Feb 2 | Streams, Processes and Permission Systems | Git                  | Intro Shell Scripting |
| Feb 3 - 9      | Regular Expressions                       | Scripting 1          | Shell Scripting Cont. |
| Feb 10 - 16    | UI Design                                 | Proj.1 Help          | HTML/CSS              |
| Feb 17 - 23    | *Midterm Recess!*                         | *Midterm Recess!*    | *Midterm Recess!*     |
| Feb 24 - Mar 2 | Object Oriented Programming               | Simple Webpage       | JavaScript            |
| Mar 3 - 9      | Model Driven Development                  | JavaScript           | JavaScript Cont.      |
| Mar 10 - 16    | Client-Server Model                       | Proj. 2 Help         | Http Requests Django  |
| Mar 17 - 23    | Network Protocols / Routing               | Django 1             | Django Cont.          |
| Mar 24 - 30    | Relational Algebra                        | Django 2             | Databases             |
| Mar 31 - Apr 6 | Cryptography / Signing / Key Exchange     | Proj. 3 Help         | User Authentication   |
| Apr 7 - 13     | *CLASSES END*                             | *CLASSES END*        | *CLASSES END*         |

** Important Deadlines
   |                          | Date Due (by 11:59pm) |
   |--------------------------+-----------------------|
   | GitHub Repo Registration | Jan 26                |
   | Proj. 1 Part 1           | Feb 2                 |
   | Proj. 1 Part 2           | Feb 16                |
   | Proj. 2 Part 1           | Mar 2                 |
   | Proj. 2 Part 2           | Mar 16                |
   | Proj. 3                  | Apr 20                |

   #+LATEX: \noindent
   *NOTE* structure and proper organization (including tentative deadlines) is
    important for maximizing your learning experience in this course. However
    should you require an extension please don't hesitate to contact the
    me (curtis.dalves@gmail.com) to work out a more flexible schedule
    
* Assessment and evaluation structure
   Grades will be calculated using the following criteria
   | Project 1       | 15% |
   | Project 2       | 15% |
   | Project 3       | 20% |
   | Labs Activities | 40% |
   | Participation   | 10% |
  
** Projects
   You will submit 3 projects each in 2 parts:
     - Project 1 will be a Bash Scripting activity
     - Project 2 will have you design a client side web app using
       Javascript/HTML/CSS
     - Project 3 a "full-stack" web app using Python Django and SQL.
   You will host the projects on GitHub and your commit history will be analyzed
   as part of your final mark (frequent, well spaced out commits will gain you
   more marks). For further details refer to the project outlines that will be
   posted on Avenue to Learn.

** Lab Activities
   There are a total of 8 Lab Activities that will be completed synchronously
   (in-class) in the first lab session of each week. TA's will be available to
   assist you through the activities, and full marks will be given for each
   successful completion. Should you miss a lab activity, you may contact a TA
   about completing it asynchronously over Discord.

** Participation
   Participation marks can be earned in the following ways:
     - Sharing notes on a lecture session (upload to avenue)
     - Sharing notes on a (non-activity) lab session (upload to avenue)
     - Answering a live lecture/lab question
     - Creating and sharing a coding activity relevant to the lab content
   If you consider each of the above to be worth 1 "Participation Mark", there
   are a total of 5 Participation Marks to earn throughout the semester. This
   makes each Participation Mark worth 2% of your final grade. If you have
   another idea for how you would prefer to earn Participation Marks, please to
   hesitate to contact the instructor about it.
   
