assessments-750/course-syllabus/Course-Syllabus.tex
% Created 2021-03-18 Thu 20:04
% Intended LaTeX compiler: pdflatex
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{geometry}
\usepackage[english]{babel}
\setlength{\parindent}{4em}
\setlength{\parskip}{1em}
\setcounter{secnumdepth}{0}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
\usepackage[mathletters]{ucs}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Curtis D'Alves}
\date{March 18th, 2021}
\title{CS 1XA3: Course Syllabus}
\hypersetup{
 pdfauthor={Curtis D'Alves},
 pdftitle={CS 1XA3: Course Syllabus},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Course Description}
\label{sec:org6645663}

Computer Science 1XA3 is an experiential learning based course designed to teach
first year students common tools/skills utilized in the practice of software
engineering while learning about underlying theoretical computer science
concepts. Students are expected to already have a beginners knowledge of the
python programming language (previous or concurrent enrollment in CS 1MD3 is
recommended)

\subsection{Instructor (Contact Info)}
\label{sec:orgf5b6043}
\begin{itemize}
\item Curtis D'Alves, Ph.D Candidate @ McMaster University
\item Office Hours: in ITB 229 (no specific hours, but please email before
dropping by)
\item Email: curtis.dalves@gmail.com
\end{itemize}

\subsection{Lecture/Lab Sessions}
\label{sec:orgadee886}

\begin{center}
\begin{tabular}{lll}
\textbf{Lectures} & Fr 9:30AM & 10:20AM in BSB B135\\
\textbf{Lab Section L01} & TuFr 2:30PM & 4:30PM in BSB 249\\
\textbf{Lab Section L02} & TuTh 9:30AM & 11:30AM in BSB 244\\
\textbf{Lab Section L03} & MoWe 9:30AM & 11:20AM in KTH B123\\
\textbf{Lab Section L04} & MoTh 12:30PM & 2:30PM in KTH B123\\
\end{tabular}
\end{center}

\subsection{Lecture Sessions}
\label{sec:org2128252}
There will be a single Lecture session each week presenting concepts in
computer science interleaved with discussion sessions on these topics.
Students will be broken up into groups for guided discussion sessions and
brainstorm answers that will be presented in class by a volunteer
\subsection{Lab Sessions}
\label{sec:org3def4c4}
There will be two Lab sessions each week. The first session each week will be a Lab
Activity session that students will complete with TA assistance as needed and
the second session will present practical programming content with
live coding demonstrations (that students will be encouraged to follow along
with).

\section{Course Schedule with topics}
\label{sec:org7219ea8}
\begin{center}
\begin{tabular}{llll}
Week & Lecture & Activity & Lab\\
\hline
Jan 6 - 12 & McMaster ECCS / Intro Un*x Systems & Installation Session & Course Overview\\
Jan 13 - 19 & Shells, FileSystems and Trees & Terminus Game & SSH Activity\\
Jan 20 - 26 & Version Control, Git and Graphs & FileSystems & Git Repo Creation\\
Jan 27 - Feb 2 & Streams, Processes and Permission Systems & Git & Intro Shell Scripting\\
Feb 3 - 9 & Regular Expressions & Scripting 1 & Shell Scripting Cont.\\
Feb 10 - 16 & UI Design & Proj.1 Help & HTML/CSS\\
Feb 17 - 23 & \textbf{Midterm Recess!} & \textbf{Midterm Recess!} & \textbf{Midterm Recess!}\\
Feb 24 - Mar 2 & Object Oriented Programming & Simple Webpage & JavaScript\\
Mar 3 - 9 & Model Driven Development & JavaScript & JavaScript Cont.\\
Mar 10 - 16 & Client-Server Model & Proj. 2 Help & Http Requests Django\\
Mar 17 - 23 & Network Protocols / Routing & Django 1 & Django Cont.\\
Mar 24 - 30 & Relational Algebra & Django 2 & Databases\\
Mar 31 - Apr 6 & Cryptography / Signing / Key Exchange & Proj. 3 Help & User Authentication\\
Apr 7 - 13 & \textbf{CLASSES END} & \textbf{CLASSES END} & \textbf{CLASSES END}\\
\end{tabular}
\end{center}

\subsection{Important Deadlines}
\label{sec:org641cb77}
\begin{center}
\begin{tabular}{ll}
 & Date Due (by 11:59pm)\\
\hline
GitHub Repo Registration & Jan 26\\
Proj. 1 Part 1 & Feb 2\\
Proj. 1 Part 2 & Feb 16\\
Proj. 2 Part 1 & Mar 2\\
Proj. 2 Part 2 & Mar 16\\
Proj. 3 & Apr 20\\
\end{tabular}
\end{center}

\noindent
\textbf{NOTE} structure and proper organization (including tentative deadlines) is
 important for maximizing your learning experience in this course. However
 should you require an extension please don't hesitate to contact the
 me (curtis.dalves@gmail.com) to work out a more flexible schedule

\section{Assessment and evaluation structure}
\label{sec:org937fffb}
Grades will be calculated using the following criteria
\begin{center}
\begin{tabular}{ll}
Project 1 & 15\%\\
Project 2 & 15\%\\
Project 3 & 20\%\\
Labs Activities & 40\%\\
Participation & 10\%\\
\end{tabular}
\end{center}

\subsection{Projects}
\label{sec:orgf44f472}
You will submit 3 projects each in 2 parts:
\begin{itemize}
\item Project 1 will be a Bash Scripting activity
\item Project 2 will have you design a client side web app using
Javascript/HTML/CSS
\item Project 3 a "full-stack" web app using Python Django and SQL.
\end{itemize}
You will host the projects on GitHub and your commit history will be analyzed
as part of your final mark (frequent, well spaced out commits will gain you
more marks). For further details refer to the project outlines that will be
posted on Avenue to Learn.

\subsection{Lab Activities}
\label{sec:org2011fce}
There are a total of 8 Lab Activities that will be completed synchronously
(in-class) in the first lab session of each week. TA's will be available to
assist you through the activities, and full marks will be given for each
successful completion. Should you miss a lab activity, you may contact a TA
about completing it asynchronously over Discord.

\subsection{Participation}
\label{sec:orgbfb8e42}
Participation marks can be earned in the following ways:
\begin{itemize}
\item Sharing notes on a lecture session (upload to avenue)
\item Sharing notes on a (non-activity) lab session (upload to avenue)
\item Answering a live lecture/lab question
\item Creating and sharing a coding activity relevant to the lab content
\end{itemize}
If you consider each of the above to be worth 1 "Participation Mark", there
are a total of 5 Participation Marks to earn throughout the semester. This
makes each Participation Mark worth 2\% of your final grade. If you have
another idea for how you would prefer to earn Participation Marks, please to
hesitate to contact the instructor about it.
