assessments-750/course-syllabus/Course-Syllabus.org
* Intended Learning Outcomes
CS 1XA3 has the following Intended Learning Outcomes, i.e. 
- students should have the practical skills to
  + Use Un*x command line interfaces to navigate, create and manipulate
    filesystems, ssh/scp to access remote servers and the Un*x commands
    top*/ps/kill to manage system processes
  + Investigate network connections using the Un*x command netstat
  + Manage a code base using git version control
  + Design a simple webpage using HTML, CSS and Javascript, then a web server
    application using the python Django framework, and a simple SQL database 
 
- and students should have enough working knowledge of computer science concepts to
  + Recognize corresponding tree data structures in file systems, directed graph
    data structures in git revision commit history and basic UI principals used
    in webpage design
  + Define regular expressions for string enumeration/matching, conceptual
    models (using UML Diagrams) corresponding to module relationships in python
    code and basic relational algebra equations corresponding to SQL queries

#+LATEX: \noindent
Learning outcomes for practical skills are largely cummulative, i.e. use of
command line tools will be necessary to use version control which will be
necessary to manage your code to build web pages, which is in turn necessary to
have a functioning server which is also in turn necessary to implement a
database. Therefore evaluation of skills acquired will be reinforced by
evaluation of subsequent skills. Furthermore learning outcomes for computer
science concepts underly the use of corresponding practical skills

* Course Requirements
** Course Prerequisites
  - High school calculus 
  - Current or previous enrollment is CS 1MD3 *OR* sufficient knowledge of the
    python programming language (instructors permission required for the latter)
      
** Course Expectations
   Throughout the course, students are expected to
   - get to know and use your peers (fellow classmates) as a resource 
   - seek out ways to extend the core objectives of a project to suit your
     learning needs
   - consult the instructor before attempting to implement features that may be too difficult
   - organize your work so that your assignments are done in a timely manner (as
     will be evident by your GitHub commit history)
   - follow instructions for submitting assignments included in the assignment outlines
   - students are responsible to ensure all code they submit compiles (on the mac1xa3.ca
     server) before submission *FAILURE TO SUBMIT CODE THAT COMPILES CAN RESULT
     IN A MARK OF ZERO*
     
** Resources
*** Mandatory 
   You are required to create specialized accounts for the following services
   - [[http://avenue.mcmaster.ca/][Avenue to Learn]]: will serve as the course webpage. All announcements and
     course content (including slides, grades, project templates) will be posted
     there. Please check it regularly
   - [[https://github.com][GitHub]]: a free, public repository with version control you will be using to
     store your source code for your assignments
     * Click the link above, sign up for an account (if you don't already have
       one)
     * Sign up for *GitHub Student Developer Pack* by following the instructions
       here
       - [[https://help.github.com/en/github/teaching-and-learning-with-github-education/applying-for-a-student-developer-pack]])
     * Create a *private repository* named CS1XA3
     * From the repositories main page, go to Settings / Collaborators
     * Search for me, dalvescb, and add me as a collaborator
     * Message me on Discord with your Repo URL and Mac ID
     * *YOU MUST REGISTER YOUR GITHUB REPO BEFORE THE END OF THE WEEK 2*
   - [[https://discordapp.com/][Discord]]: an instant messaging service that's very popular among gamers but
     also to some extent project developers
     * Join the CS1XA3_2020 Discord with the following link https://discord.gg/PjGEY3f
   - [[https://mac1xa3.ca]]: a Ubuntu based server, you can *ssh* into it using your Mac Id
     and the first 8 characters of your student number as password (message me
     on discord if you cannot connect). Once you've logged into the server, used
     the command *passwd* to change your password
*** Recommended
   - [[https://www.ubuntu.com][Ubuntu]]: a very popular linux OS
   - [[https://docs.microsoft.com/en-us/windows/wsl/install-win10][Windows Subsystem for Linux]]: a new and very convenient way to run Linux
     from within Windows
   - [[https://www.spacemacs.org/][Spacemacs]]: a distribution of emacs that combines the power of vim, my
     editor of choice
   - [[https://stackoverflow.com][StackOverflow]]: every hackers best friend, a Q&A forum for all things coding
   - [[https://desktop.github.com/][GitHub Desktop]]: a graphical app that makes doing basic operations with
     GitHub quick and painless
   - Suggest other resources on discord for participation marks
   
* University Policies
** Missed Work / MSAF Policy     
   In the event of an absence for medical or other reasons, students should
   review and follow the Academic Regulation in the Undergraduate Calendar
   “Requests for Relief for Missed Academic Term Work”.

   Students are expected to contact the instructor (see Contact Info) to request
   relief for missed marked work, as well as follow the official McMaster policy
   for submission of MSAF's (see [[https://www.mcmaster.ca/msaf/)]].
   
   Relief for the following works can be provided:
   - *Projects* will receive a 3 day extension
   - *Lab Activities* will have their marks shifted onto the rest of the labs

** Usage of On-Line Resources Policy
  In this course we will be using Avenue to learn and Discord messaging system.
  Students should be aware that, when they access the electronic components of
  this course, private information such as first and last names, user names for
  the McMaster e-mail accounts,and program affiliation may become apparent to
  all other students in the same course. The available information is dependent
  on the technology used. Continuation in this course will be deemed consent to
  this disclosure. If you have any questions or concerns about such disclosure
  please discuss this with the course instructor.
  
