assessments-750/course-syllabus/Course-Syllabus.tex

\section{Intended Learning Outcomes}
\label{sec:org01cf60f}
CS 1XA3 has the following Intended Learning Outcomes, i.e. 
\begin{itemize}
\item students should have the practical skills to
\begin{itemize}
\item Use Un*x command line interfaces to navigate, create and manipulate
filesystems, ssh/scp to access remote servers and the Un*x commands
top*/ps/kill to manage system processes
\item Investigate network connections using the Un*x command netstat
\item Manage a code base using git version control
\item Design a simple webpage using HTML, CSS and Javascript, then a web server
application using the python Django framework, and a simple SQL database
\end{itemize}

\item and students should have enough working knowledge of computer science concepts to
\begin{itemize}
\item Recognize corresponding tree data structures in file systems, directed graph
data structures in git revision commit history and basic UI principals used
in webpage design
\item Define regular expressions for string enumeration/matching, conceptual
models (using UML Diagrams) corresponding to module relationships in python
code and basic relational algebra equations corresponding to SQL queries
\end{itemize}
\end{itemize}

\noindent
Learning outcomes for practical skills are largely cummulative, i.e. use of
command line tools will be necessary to use version control which will be
necessary to manage your code to build web pages, which is in turn necessary to
have a functioning server which is also in turn necessary to implement a
database. Therefore evaluation of skills acquired will be reinforced by
evaluation of subsequent skills. Furthermore learning outcomes for computer
science concepts underly the use of corresponding practical skills

\section{Course Requirements}
\label{sec:org0faad5c}
\subsection{Course Prerequisites}
\label{sec:org0a21196}
\begin{itemize}
\item High school calculus
\item Current or previous enrollment is CS 1MD3 \textbf{OR} sufficient knowledge of the
python programming language (instructors permission required for the latter)
\end{itemize}

\subsection{Course Expectations}
\label{sec:org3a9325b}
Throughout the course, students are expected to
\begin{itemize}
\item get to know and use your peers (fellow classmates) as a resource
\item seek out ways to extend the core objectives of a project to suit your
learning needs
\item consult the instructor before attempting to implement features that may be too difficult
\item organize your work so that your assignments are done in a timely manner (as
will be evident by your GitHub commit history)
\item follow instructions for submitting assignments included in the assignment outlines
\item students are responsible to ensure all code they submit compiles (on the mac1xa3.ca
server) before submission \textbf{FAILURE TO SUBMIT CODE THAT COMPILES CAN RESULT
IN A MARK OF ZERO}
\end{itemize}

\subsection{Resources}
\label{sec:org88dc284}
\subsubsection{Mandatory}
\label{sec:org6e59270}
You are required to create specialized accounts for the following services
\begin{itemize}
\item \href{http://avenue.mcmaster.ca/}{Avenue to Learn}: will serve as the course webpage. All announcements and
course content (including slides, grades, project templates) will be posted
there. Please check it regularly
\item \href{https://github.com}{GitHub}: a free, public repository with version control you will be using to
store your source code for your assignments
\begin{itemize}
\item Click the link above, sign up for an account (if you don't already have
one)
\item Sign up for \textbf{GitHub Student Developer Pack} by following the instructions
here
\begin{itemize}
\item \url{https://help.github.com/en/github/teaching-and-learning-with-github-education/applying-for-a-student-developer-pack})
\end{itemize}
\item Create a \textbf{private repository} named CS1XA3
\item From the repositories main page, go to Settings / Collaborators
\item Search for me, dalvescb, and add me as a collaborator
\item Message me on Discord with your Repo URL and Mac ID
\item \textbf{YOU MUST REGISTER YOUR GITHUB REPO BEFORE THE END OF THE WEEK 2}
\end{itemize}
\item \href{https://discordapp.com/}{Discord}: an instant messaging service that's very popular among gamers but
also to some extent project developers
\begin{itemize}
\item Join the CS1XA3\textsubscript{2020} Discord with the following link \url{https://discord.gg/PjGEY3f}
\end{itemize}
\item \url{https://mac1xa3.ca}: a Ubuntu based server, you can \textbf{ssh} into it using your Mac Id
and the first 8 characters of your student number as password (message me
on discord if you cannot connect). Once you've logged into the server, used
the command \textbf{passwd} to change your password
\end{itemize}
\subsubsection{Recommended}
\label{sec:org1dabd0e}
\begin{itemize}
\item \href{https://www.ubuntu.com}{Ubuntu}: a very popular linux OS
\item \href{https://docs.microsoft.com/en-us/windows/wsl/install-win10}{Windows Subsystem for Linux}: a new and very convenient way to run Linux
from within Windows
\item \href{https://www.spacemacs.org/}{Spacemacs}: a distribution of emacs that combines the power of vim, my
editor of choice
\item \href{https://stackoverflow.com}{StackOverflow}: every hackers best friend, a Q\&A forum for all things coding
\item \href{https://desktop.github.com/}{GitHub Desktop}: a graphical app that makes doing basic operations with
GitHub quick and painless
\item Suggest other resources on discord for participation marks
\end{itemize}

\section{University Policies}
\label{sec:org5b971cb}
\subsection{Missed Work / MSAF Policy}
\label{sec:orge436524}
In the event of an absence for medical or other reasons, students should
review and follow the Academic Regulation in the Undergraduate Calendar
“Requests for Relief for Missed Academic Term Work”.

Students are expected to contact the instructor (see Contact Info) to request
relief for missed marked work, as well as follow the official McMaster policy
for submission of MSAF's (see \url{https://www.mcmaster.ca/msaf/)}.

Relief for the following works can be provided:
\begin{itemize}
\item \textbf{Projects} will receive a 3 day extension
\item \textbf{Lab Activities} will have their marks shifted onto the rest of the labs
\end{itemize}

\subsection{Usage of On-Line Resources Policy}
\label{sec:orga5267bd}
In this course we will be using Avenue to learn and Discord messaging system.
Students should be aware that, when they access the electronic components of
this course, private information such as first and last names, user names for
the McMaster e-mail accounts,and program affiliation may become apparent to
all other students in the same course. The available information is dependent
on the technology used. Continuation in this course will be deemed consent to
this disclosure. If you have any questions or concerns about such disclosure
please discuss this with the course instructor.
