assessments-750/course-syllabus/Course-Syllabus.org
** Academic Ethics

   You are expected to exhibit honesty and use ethical behaviour in all aspects of the learning process. Academic credentials you earn are rooted in principles of honesty and academic integrity. 
   Academic dishonesty is to knowingly act or fail to act in a way that results or could result in unearned academic credit or advantage.
   This behaviour can result in serious consequences, e.g. the grade of zero on an assignment, loss of credit with a notation on the transcript
   (notation reads: “Grade of F assigned for academic dishonesty”), and/or suspension or expulsion from the university. It is your responsibility to 
   understand what constitutes academic dishonesty.
   For information on the various types of academic dishonesty please refer to the Academic Integrity Policy, located at http://www.mcmaster.ca/academicintegrity.
   The following illustrates only four forms of academic dishonesty:
   1. Plagiarism, e.g. the submission of work that is not one’s own or for which other credit has been obtained.
   2. Collaboration where individual work is expected. You are allowed, and encouraged, to collaborate on the exercise questions. (The tutorials are typically not expected to cover all exercise questions.)
   3. Improper collaboration in group work.
   4. Copying or using unauthorised aids in tests and examinations.

   *Note*: Although you may use code found online for your assignments, you must reference your source in the projects README. Grades for assignments that are entirely or mostly others code will reflect such.
   
** Academic Accommodation of Students with Disabilites
   Students who require academic accommodation must contact Student Accessibility Services (SAS) to make arrangements with a Program Coordinator. 
   Academic accommodations must be arranged for each term of study. Student Accessibility Services can be contacted by phone 905-525-9140 ext. 
   28652 or e-mail sas@mcmaster.ca. For further information, consult McMaster University’s [[http://www.mcmaster.ca/policy/Students-AcademicStudies/AcademicAccommodation-StudentsWithDisabilities.pdf][Policy for Academic Accommodation of Students with Disabilities]]
   
** Academic Accommodation For Religious, Indigenous Or Spiritual Observances (RISO)
  Students requiring academic accommodation based on religious, indigenous or
  spiritual observances should follow the procedures set out in the RISO policy.
  Students requiring a RISO accommodation should submit their request to their
  Faculty Office normally within 10 working days of the beginning of term in which
  they anticipate a need for accommodation or to the Registrar's Office prior to
  their examinations. Students should also contact their instructors as soon as
  possible to make alternative arrangements for classes, assignments, and tests
  
** Discrimination
   “The Faculty of Engineering is concerned with ensuring an environment that is free of all adverse discrimination. If there is a problem that cannot be resolved by discussion among the persons concerned, individuals are reminded that they should contact the Department Chair, the Sexual Harassment Office or the Human Rights Consultant, as soon as possible.”

** Disclaimer / Course Changes
   The instructor and university reserve the right to modify elements of the
   course during the term. The university may change the dates and deadlines for
   any or all courses in extreme circumstances. Changes will be communicated
   through regular McMaster communication channels, such as McMaster Daily News,
   A2L and/or McMaster email. It is the responsibility of the student to check
   their McMaster email and course websites weekly during the term and to note
   any changes.
    
#  LocalWords:  Un XA ssh scp webpage ps grep netstat Javascript Django TODO
#  LocalWords:  cummulative demonstratable gamers GitHub
